
Lexicon_ru: dict[str, str] = {'/start': '<b>Привет, друг!</b>\nЭто бот,'
                                        'в котором ты сможешь узнать о предстоящих мероприятиях в твоем городе или'
                                        ' создать свои!\nТы сможешь находить друзей и единомышленников в одном месте!',
                              'calendar': 'календарь событий',
                              'new_event': 'создать свое событие',

                              }
Lexicon_form_new_event: dict[str, str] = {'Yes_date': '✅',

                                          'No_date': '❌',
                                          'Yes': '✅',

                                          'No': '❌',

                                          'Reg': 'Добавить мероприятие',

                                          'Cen': 'Отменить',

                                          'Hi_event': 'Введите заголовок своего мероприятия '
                                                      'Например: Концерт Ивана Иванова или '
                                                      'Сбор желающих покататься на велосипедах и т.п.',

                                          'Conf_name': 'Название мероприятия:',
                                          # 'url_event': 'Добавьте ссылку на исходник',

                                          'Info_event': 'Введите всю необходимую информацию про свое мероприятие '
                                                        'место проведение, формат и т.п..',

                                          'Conf_info': 'Информация о мероприятие:',

                                          'Conf_date': 'Дата:',

                                          'Date_event': 'Введите дату и время мероприятия в формате ГГГГ-ММ-ДД ЧЧ:ММ '
                                                        'пример: 2023-12-03 17:30',
                                          'Error_date': 'Не верный формат даты попробуйте еще раз'

                                          }
Lexicon_month: dict[int, str] = {1: 'Январь', 2: 'Февраль',
                                 3: 'Март', 4: 'Апрель',
                                 5: 'Май', 6: 'Июнь',
                                 7: 'Июль', 8: 'Август',
                                 9: 'Сентябрь', 10: ' Октябрь',
                                 11: 'Ноябрь', 12: 'Декабрь',
                                 'forward_c': '>>',
                                 'backward_c': '<<',
                                 }
LEXICON_COMMANDS: dict[str, str] = {
    'help': 'Справочник по работе бота'}

Lexicon_day_with_event = '🔥'
